Tekla.Structures.Dialog.StructuresDialogArrayAttribute
The StructuresDialogArrayAttribute class specifies the attribute name for which the attributed
interface will be used as a list item definition. The attributed interface is used to define the
structure of the DataGridView items. In other words it defines all the possible DataGridView
columns. The interface is bound to the DataGridView by referencing the interface's attribute name
from the DataGridView's Tag property.

Tekla.Structures.Dialog.StructuresDialogArrayAttribute.#ctor(System.String)
Initializes a new StructuresDialogArrayAttribute instance.
attributeName: The attribute name of the attributed interface.

Tekla.Structures.Dialog.StructuresDialogArrayAttribute.AttributeName
Gets the attribute name of the interface.

Tekla.Structures.Dialog.StructuresDialogArrayAttribute.ToString
Returns a string that represents the current StructuresDialogArrayAttribute object.
Returns: A string that represents the current StructuresDialogArrayAttribute object.